using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Nri.AssetConfigurators.Core.LegacyCatalogs
{
    internal static class LandMarineLegacySpecs
    {
        public static List<string> Types { get; } = new List<string>
        {"Наземный", "Гибрид", "Водный", "Подводный"};

        public static List<string> Quality { get; } = new List<string>
        {"Ужасное", "Плохое", "Стандартное", "Качественное", "Надёжное"};

        public static List<string> Sizes { get; } = new List<string>
        {"C", "S", "M", "L", "VL", "A", "X", "XL", "XXL"};

        public static Dictionary<string, List<string>> Classes { get; } = new Dictionary<string, List<string>>
        {
            {"C", new List<string> {"Мотоцикл", "Батискаф", "Подводный аппарат", "Меха", "Амфибия", "Катер"}},
            {"S", new List<string>{"Бронеавтомобиль", "Батискаф", "Подводный аппарат", "Меха", "Амфибия", "Катер", "Болотный Катер", "Тягач", "Тягач(гиб.)"}},
            {"M", new List<string>{"Бронеавтомобиль", "Подводная лодка", "Меха", "БМП", "Грузовик", "Миноносец", "БМП(гиб.)", "Болотный Катер", "Тягач", "Тягач(гиб.)"}},
            {"L", new List<string>{"Лёгкий танк", "Подводная лодка", "Меха", "БМП", "БМП(гиб.)", "Лёгкий танк(гиб.)", "Миноносец", "Корвет", "МДК", "Болотный Катер", "Грузовик"}},
            {"VL", new List<string>{"Лёгкий танк", "Подводная лодка", "Мегамеха", "Лёгкий танк(гиб.)", "Эсминец", "МДК", "Грузовик"}},
            {"A", new List<string> {"Тяжёлый танк", "Подводная лодка", "САУ", "Мегамеха", "Подвижная крепость", "Эсминец", "Фрегат", "МДК"}},
            {"X", new List<string> {"Крейсер", "Подводный крейсер", "БДК", "Фрегат", "Подвижная крепость"}},
            {"XL", new List<string> {"Крейсер", "Подводный крейсер", "БДК", "Экраноплан"}},
            {"XXL", new List<string> {"Линкор", "Авианосец", "УДК", "Подводный левиафан", "Экраноплан"}}
        };

        public static Dictionary<string, List<string>> ClassesByType { get; } = new Dictionary<string, List<string>>
        {
            {"Наземный", new List<string> {"Мотоцикл", "Бронеавтомобиль", "Тягач", "Меха", "Грузовик", "БМП", "Лёгкий танк", "Тяжёлый танк", "САУ", "Мегамеха", "Подвижная крепость"}},
            {"Водный", new List<string>{"Катер", "Миноносец", "Корвет", "Эсминец", "Фрегат", "Крейсер", "Линкор", "Авианосец", "МДК", "БДК", "УДК"}},
            {"Гибрид", new List<string>{ "Амфибия", "Тягач(гиб.)", "БМП(гиб.)", "Лёгкий танк(гиб.)", "Болотный Катер", "Экраноплан"}},
            {"Подводный", new List<string>{ "Подводный аппарат", "Батискаф", "Подводная лодка", "Подводный крейсер", "Подводный левиафан"}}
        };

        public static Dictionary<string, List<string>> LandEngineTypeByClass { get; } = new Dictionary<string, List<string>>
        {
            {"Мотоцикл", new List<string> {"Колёса", "Гусеницы", "Парящая подушка", "Шагоход"}},
            {"Бронеавтомобиль", new List<string> {"Колёса", "Гусеницы", "Парящая подушка", "Шагоход"}},
            {"Тягач", new List<string> {"Колёса", "Гусеницы", "Парящая подушка"}},
            {"Меха", new List<string> {"Шагоход"}},
            {"Грузовик", new List<string> {"Колёса", "Гусеницы", "Парящая подушка"}},
            {"БМП", new List<string> {"Колёса", "Гусеницы", "Парящая подушка", "Шагоход"}},
            {"Лёгкий танк", new List<string> {"Колёса", "Гусеницы", "Парящая подушка", "Шагоход"}},
            {"Тяжёлый танк", new List<string> {"Гусеницы", "Парящая подушка", "Шагоход"}},
            {"САУ", new List<string> {"Колёса", "Гусеницы", "Парящая подушка", "Шагоход"}},
            {"Мегамеха", new List<string> {"Шагоход"}},
            {"Подвижная крепость", new List<string> {"Колёса", "Гусеницы", "Парящая подушка"}},

            {"Амфибия", new List<string>{"Колёса", "Гусеницы", "Воздушная подушка"}},
            {"Тягач(гиб.)", new List<string>{"Колёса", "Гусеницы", "Воздушная подушка"}},
            {"БМП(гиб.)", new List<string>{"Колёса", "Гусеницы", "Воздушная подушка"}},
            {"Лёгкий танк(гиб.)", new List<string>{ "Колёса", "Гусеницы", "Воздушная подушка"}},
            {"Болотный Катер", new List<string>{"Воздушная подушка"}},
            {"Экраноплан", new List<string>{"Воздушная подушка"}}
        };

        public static Dictionary<string, List<string>> WaterEngineTypeByClass { get; } = new Dictionary<string, List<string>>
        {
            {"Катер", new List<string> {"1 Пропеллер", "2 Пропеллера", "3 Пропеллера", "4 Пропеллера", "1 Вентилятор", "2 Вентилятора", "1 Реактивный двигатель", "Водомёт"}},
            {"Миноносец", new List<string> {"1 Пропеллер", "2 Пропеллера", "3 Пропеллера", "4 Пропеллера", "2 Вентилятора", "Водомёт"}},
            {"Корвет", new List<string> {"1 Пропеллер", "2 Пропеллера", "3 Пропеллера", "4 Пропеллера"}},
            {"Эсминец", new List<string> {"1 Пропеллер", "2 Пропеллера", "3 Пропеллера", "4 Пропеллера"}},
            {"Фрегат", new List<string> {"2 Пропеллера", "3 Пропеллера", "4 Пропеллера"}},
            {"Крейсер", new List<string> {"2 Пропеллера", "3 Пропеллера", "4 Пропеллера"}},
            {"Линкор", new List<string> {"2 Пропеллера", "3 Пропеллера", "4 Пропеллера"}},
            {"Авианосец", new List<string> {"3 Пропеллера", "4 Пропеллера"}},
            {"МДК", new List<string> {"1 Пропеллер", "2 Пропеллера", "3 Пропеллера", "4 Пропеллера", "Водомёт"}},
            {"БДК", new List<string> {"2 Пропеллера", "3 Пропеллера", "4 Пропеллера"}},
            {"УДК", new List<string> {"3 Пропеллера", "4 Пропеллера"}},

            {"Амфибия", new List<string>{"1 Пропеллер", "2 Пропеллера", "3 Пропеллера", "4 Пропеллера", "1 Вентилятор", "2 Вентилятора", "1 Реактивный двигатель", "Водомёт"}},
            {"Тягач(гиб.)", new List<string>{"1 Пропеллер", "2 Пропеллера", "Водомёт"}},
            {"БМП(гиб.)", new List<string>{"1 Пропеллер", "2 Пропеллера", "Водомёт"}},
            {"Лёгкий танк(гиб.)", new List<string>{"1 Пропеллер", "2 Пропеллера"}},
            {"Болотный Катер", new List<string>{ "1 Вентилятор", "2 Вентилятора", "Водомёт"}},
            {"Экраноплан", new List<string>{ "4 Реактивных двигателя", "8 Реактивных двигателей" }},

            {"Подводный аппарат", new List<string>{"1 Пропеллер", "2 Пропеллера", "Водомёт", "Плавники"}},
            {"Батискаф", new List<string>{"1 Пропеллер", "2 Пропеллера", "Плавники"}},
            {"Подводная лодка", new List<string>{"1 Пропеллер", "Водомёт", "Плавники"}},
            {"Подводный крейсер", new List<string>{"1 Пропеллер", "Плавники"}},
            {"Подводный левиафан", new List<string>{"1 Пропеллер", "2 Пропеллера", "3 Пропеллера", "4 Пропеллера", "Плавники"}}
        };

        public static Dictionary<string, Dictionary<string, int>> SensorCostBySize { get; } = new Dictionary<string, Dictionary<string, int>>
        {
            {"C", new Dictionary<string, int>{{ "Радиолокационные", 150 },{ "Магнитные", 300 },{ "Оптические", 1000 }}},
            {"S", new Dictionary<string, int>{{ "Радиолокационные", 300 },{ "Магнитные", 600 },{ "Оптические", 2000 }}},
            {"M", new Dictionary<string, int>{{ "Радиолокационные", 600 },{ "Магнитные", 1200 },{ "Оптические", 4000 }}},
            {"L", new Dictionary<string, int>{{ "Радиолокационные", 1200 },{ "Магнитные", 2400 },{ "Оптические", 8000 }}},
            {"VL", new Dictionary<string, int>{{ "Радиолокационные", 2400 },{ "Магнитные", 4800 },{ "Оптические", 16000 }}},
            {"A", new Dictionary<string, int>{{ "Радиолокационные", 4800 },{ "Магнитные", 9600 },{ "Оптические", 32000 }}},
            {"X", new Dictionary<string, int>{{ "Радиолокационные", 9600 },{ "Магнитные", 19200 },{ "Оптические", 64000 }}},
            {"XL", new Dictionary<string, int>{{ "Радиолокационные", 19200 },{ "Магнитные", 38400 },{ "Оптические", 128000 }}},
            {"XXL", new Dictionary<string, int>{{ "Радиолокационные", 38400 },{ "Магнитные", 76800 },{ "Оптические", 256000 }}}
        };

        public static Dictionary<string, int> SizeCost { get; } = new Dictionary<string, int>
        {
            { "C", 750 },
            { "S", 1780 },
            { "M", 3250 },
            { "L", 7120 },
            { "VL", 16910 },
            { "A", 29090 },
            { "X", 50550 },
            { "XL", 99350 },
            { "XXL", 175000 }
        };

        public static Dictionary<string, int> StorageCapacitiesBySize { get; } = new Dictionary<string, int>
        {
            { "C", 10 },
            { "S", 30 },
            { "M", 50 },
            { "L", 70 },
            { "VL", 100 },
            { "A", 120 },
            { "X", 150 },
            { "XL", 190 },
            { "XXL", 250 },
            { "Fuel", 30 }
        };

        public static Dictionary<string, double> ClassCost { get; } = new Dictionary<string, double>
        {
            { "Мотоцикл", 0.5 },
            { "Бронеавтомобиль", 1 },
            { "Тягач", 1 },
            { "Меха", 1.5 },
            { "Грузовик", 1.2 },
            { "БМП", 1.5 },
            { "Лёгкий танк", 2 },
            { "Тяжёлый танк", 2 },
            { "САУ", 3 },
            { "Мегамеха", 2.5 },
            { "Подвижная крепость", 3 },

            { "Амфибия", 1.5 },
            { "Тягач(гиб.)", 2 },
            { "БМП(гиб.)", 3 },
            { "Лёгкий танк(гиб.)", 3.5 },
            { "Болотный Катер", 3 },
            { "Экраноплан", 4 },

            { "Катер", 1 },
            { "Миноносец", 1.1 },
            { "Корвет", 1.1 },
            { "Эсминец", 1 },
            { "Фрегат", 1.2 },
            { "Крейсер", 1.2 },
            { "Линкор", 1.6 },
            { "Авианосец", 2 },
            { "МДК", 1 },
            { "БДК", 1 },
            { "УДК", 1 },

            { "Подводный аппарат", 1 },
            { "Батискаф", 3 },
            { "Подводная лодка", 2 },
            { "Подводный крейсер", 2.5 },
            { "Подводный левиафан", 4 }
        };

        public static Dictionary<string, double> EngineCostMultiplier { get; } = new Dictionary<string, double>
        {
            { "Колёса", 1 },
            { "Гусеницы", 1 },
            { "Воздушная подушка", 3 },
            { "Парящая подушка", 4 },
            { "Шагоход", 1.5 },

            { "1 Пропеллер", 1 },
            { "2 Пропеллера", 1.5 },
            { "3 Пропеллера", 1.7 },
            { "4 Пропеллера", 2 },
            { "1 Вентилятор", 1.2 },
            { "2 Вентилятора", 1.6 },
            { "1 Реактивный двигатель", 3 },
            { "Водомёт", 1 },
            { "Плавники", 1 },

            { "4 Реактивных двигателя", 3 },
            { "8 Реактивных двигателей", 4 }
        };

        public static Dictionary<string, (double ManeuverabilityBaseMod, double SpeedBaseMod)> EngineManeuverabilityAndSpeedMultiplier { get; } = new Dictionary<string, (double, double)>
        {
            { "Колёса", (1, 3) },
            { "Гусеницы", (2, 2) },
            { "Воздушная подушка", (2, 1) },
            { "Парящая подушка", (2, 2) },
            { "Шагоход", (3, 1) },

            { "1 Пропеллер", (1, 1) },
            { "2 Пропеллера", (1.5, 1.7) },
            { "3 Пропеллера", (1.7, 2.3) },
            { "4 Пропеллера", (2, 2.6) },
            { "1 Вентилятор", (1.8, 1.2) },
            { "2 Вентилятора", (2, 1.6) },
            { "1 Реактивный двигатель", (0.5, 5) },
            { "Водомёт", (1.7, 0.9) },
            { "Плавники", (3, 0.5) },

            { "4 Реактивных двигателя", (0.2, 16) },
            { "8 Реактивных двигателей", (0.1, 24) }
        };

        public static Dictionary<string, double> QualityCost { get; } = new Dictionary<string, double>
        {
            { "Ужасное", 0.25 },
            { "Плохое", 0.5 },
            { "Стандартное", 1.0 },
            { "Качественное", 1.25 },
            { "Надёжное", 1.5 }
        };

        public static Dictionary<string, int> LevelMultiplier { get; } = new Dictionary<string, int>
        {
            { "1 Уровень", 1 },
            { "2 Уровень", 3 },
            { "3 Уровень", 9 },
            { "4 Уровень", 27 }
        };

        public static Dictionary<string, int> PilotSystemCost { get; } = new Dictionary<string, int>
        {
            { "Пилотируемый", 0 },
            { "Дистанционный", 5520 },
            { "Гибрид", 7450 },
            { "ИИ", 57850 }
        };

        public static List<string> AuxHull { get; } = new List<string>
        {"Корпус из Бориформия", "Броня из Сталиниума", "Щиты из Хассатия-Б"};

        public static Dictionary<string, double> AdditionalCost { get; } = new Dictionary<string, double>
        {
            { "Б/У - низкое ВВП", 0.4 },
            { "Б/У - среднее ВВП", 0.5 },
            { "Б/У - высокое ВВП", 0.75 },
            { "Завод - бедный", 1 },
            { "Завод - средний", 1.1 },
            { "Завод - богатый", 1.25 },
        };

        public static Dictionary<string, (int RPower, int RCost)> ReatorPowerAndCost { get; } = new Dictionary<string, (int, int)>
        {
            { "Газовый", (3, 100)},
            { "Ядерный", (14, 2400)},
            { "Факелевый", (30, 7780)}
        };

        public static Dictionary<string, (int CivCellsCap, int SpecialCellsCap, int FrontWeapCap, int TurretWeapCap)> ClassCapacity { get; } = new Dictionary<string, (int, int, int, int)>
        {
            { "Мотоцикл", (1, 0, 1, 1) },
            { "Бронеавтомобиль", (2, 1, 0, 2) },
            { "Тягач", (14, 0, 0, 0) },
            { "Меха", (1, 2, 4, 2) },
            { "Грузовик", (8, 0, 0, 1) },
            { "БМП", (6, 1, 3, 2) },
            { "Лёгкий танк", (6, 2, 5, 3) },
            { "Тяжёлый танк", (6, 4, 6, 4) },
            { "САУ", (10, 2, 18, 0) },
            { "Мегамеха", (8, 4, 12, 8) },
            { "Подвижная крепость", (20, 6, 0, 16) },

            { "Амфибия", (1, 0, 0, 1) },
            { "Тягач(гиб.)", (14, 0, 0, 0) },
            { "БМП(гиб.)", (6, 1, 3, 2) },
            { "Лёгкий танк(гиб.)", (6, 2, 5, 3) },
            { "Болотный Катер", (12, 2, 2, 5) },
            { "Экраноплан", (3, 6, 9, 2) },

            { "Катер", (2, 0, 3, 1) },
            { "Миноносец", (8, 1, 4, 6) },
            { "Корвет", (10, 3, 4, 10) },
            { "Эсминец", (14, 4, 7, 12) },
            { "Фрегат", (16, 5, 7, 15) },
            { "Крейсер", (20, 6, 8, 16) },
            { "Линкор", (26, 8, 9, 20) },
            { "Авианосец", (30, 6, 0, 20) },
            { "МДК", (12, 2, 0, 6) },
            { "БДК", (18, 4, 0, 10) },
            { "УДК", (24, 6, 0, 14) },

            { "Подводный аппарат", (2, 0, 1, 1) },
            { "Батискаф", (4, 2, 1, 1) },
            { "Подводная лодка", (14, 3, 3, 4) },
            { "Подводный крейсер", (22, 6, 9, 8) },
            { "Подводный левиафан", (30, 8, 9, 15) }
        };

        public static Dictionary<string, (int Cost, bool ForwardOnly, bool MediumArm, bool HeavyArm, bool ExtremeArm)> Weapons { get; } = new Dictionary<string, (int, bool, bool, bool, bool)>
        {
            {"SGS-30 - Small Gun System", (10500, false, false, false, false)},
            {"BGS-127 - Basic Gun System", (3500, false, false, false, false)},
            {"BMS-D - Bolter Mounted System", (15500, false, false, false, false)},
            {"Лёгк. ракетная уст.", (12590, false, false, false, false)},
            {"Сред. ракетная уст.", (22350, false, true, false, false)},
            {"Тяж. ракетная уст.", (45850, false, true, true, false)},
            {"Водная Торпедная уст.", (35750, true, true, true, false)},
            {"MAC-152M - Medium Artillery Cannon", (55000, false, true, false, false)},
            {"BRG-90X - Battle Rail Gun", (68650, false, true, true, true)},
            {"HBC-305A - Heavy Battle Cannon", (68650, true, true, true, false)},
            {"TAC-75B - Tactical Auto Cannon", (19650, false, true, false, false)},
            {"MLP-55B - Multi-purpose Laser", (35000, false, false, false, false)},
            {"HPC-100 – High-Intensity Plasma Cannon", (45000, false, true, false, false)},
            {"IPC-70 – Ion Precision Cannon", (75000, false, true, false, false)},
            {"Репульсор", (82500, true, true, true, true)},
            {"LPI-36 - Light Photon Impulsor", (72250, false, true, false, false)},
            {"PXL-72 - Photon X-ray Laser", (95000, false, true, true, false)},
            {"IPL-150 – Impulse Photon Howitzer", (120000, false, true, true, true)},
            {"PLB-105 – Plasma Lance Battery", (50000, false, true, false, false)},
            {"TDC-Ω – Tesla Discharge Cannon", (76500, false, true, false, false)},
            {"TLC-500 – Tesla Lightning Cannon", (77800, false, true, true, false)},
            {"Гравицапа 1990", (83550, true, true, true, false)},
            {"IGG-620 – Ionized Gatling Gun", (17250, false, false, false, false)},
            {"MRL-07B - Miniature Rail Launcher", (22250, false, true, false, false)},
            {"TRG-42M - Tactical Rail Gun", (35500, false, true, false, false)},
            {"TLA-60 – Tactical Laser Accumulator", (35000, false, false, false, false)},
            {"PLD-170 – Plasma Lance Disruptor", (33225, false, true, false, false)},
            {"TIB-76HX – Tactical Ion Bolter", (51685, false, true, true, false)},
            {"WH-40k - War Hammer", (89950, true, true, true, true)}
        };

        public static Dictionary<string, (int WeponSize, int WeaponConsumtion)> WeaponsSizeAndConsumtion { get; } = new Dictionary<string, (int, int)>
        {
            {"SGS-30 - Small Gun System", (1, 0)},
            {"BGS-127 - Basic Gun System", (1, 0)},
            {"BMS-D - Bolter Mounted System", (2, 0)},
            {"Лёгк. ракетная уст.", (1, 0)},
            {"Сред. ракетная уст.", (2, 0)},
            {"Тяж. ракетная уст.", (4, 0)},
            {"Водная Торпедная уст.", (5, 0)},
            {"MAC-152M - Medium Artillery Cannon", (3, 0)},
            {"BRG-90X - Battle Rail Gun", (5, 4)},
            {"HBC-305A - Heavy Battle Cannon", (3, 0)},
            {"TAC-75B - Tactical Auto Cannon", (1, 0)},
            {"MLP-55B - Multi-purpose Laser", (1, 4)},
            {"HPC-100 – High-Intensity Plasma Cannon", (3, 4)},
            {"IPC-70 – Ion Precision Cannon", (2, 4)},
            {"Репульсор", (1, 1)},
            {"LPI-36 - Light Photon Impulsor", (2, 3)},
            {"PXL-72 - Photon X-ray Laser", (4, 3)},
            {"IPL-150 – Impulse Photon Howitzer", (6, 3)},
            {"PLB-105 – Plasma Lance Battery", (2, 3)},
            {"TDC-Ω – Tesla Discharge Cannon", (1, 4)},
            {"TLC-500 – Tesla Lightning Cannon", (2, 4)},
            {"Гравицапа 1990", (2, 4)},
            {"IGG-620 – Ionized Gatling Gun", (1, 1)},
            {"MRL-07B - Miniature Rail Launcher", (2, 2)},
            {"TRG-42M - Tactical Rail Gun", (2, 2)},
            {"TLA-60 – Tactical Laser Accumulator", (1, 3)},
            {"PLD-170 – Plasma Lance Disruptor", (2, 3)},
            {"TIB-76HX – Tactical Ion Bolter", (2, 2)},
            {"WH-40k - War Hammer", (9, 5)}
        };

        public static Dictionary<string, int> CivilianCellCosts { get; } = new Dictionary<string, int>
        {
            { "Склад общий", 2500 },
            { "Склад медицины", 3500 },
            { "Склад боеприпасов", 3500 },
            { "Склад топлива", 2500 },
            { "Комната на 2 человека", 3850 },
            { "Кубрик на 6 человек", 4300 },
            { "Казарма на 20 человек", 6800 },
            { "Лаборатория", 32000 },
            { "СТО Наземной техники", 25000 },
            { "СТО Снаряжения", 10000 },
            { "Очиститель руды", 12500 },
            { "Очиститель лома", 7500 },
            { "Очиститель электроники", 23000 },
            { "Очиститель органики", 15000 },
            { "Очиститель химии", 28000 },
            { "Суперкомпьютер", 255000 },
            { "Буры механические", 32500 },
            { "Буры лазерные", 58500 },
            { "Медблок", 13900 },
            { "Тюрьма", 4500 },
            { "Учебный центр", 12000 },
            { "Мастерская", 9900 },
            { "Лавка/магазин", 8550 },
            { "Бар", 9800 },
            { "Мотель", 6600 },
            { "Часовня/церковь", 1000 },
            { "Бордель", 16000 },
            { "Кафе", 5700 },
            { "Казино", 26500 },
            { "Зал боевой подготовки", 12250 },
            { "Актовый зал", 1500 },
            { "Переговорная комната", 2500 },
            { "Центр связи", 13500 },
            { "Комната крио-анабиоза", 4700 },
            { "3D-принтер", 50000 },
            { "Модуль глубокого сканирования", 50000 },
            { "Мануфакторум", 75600 },
            { "Ангар общего назначения", 56700 },
            { "Ускоритель выхлопа", 40300 }
        };

        public static Dictionary<string, int> SpecialCellCosts { get; } = new Dictionary<string, int>
        {
            { "Модуль радио-оптич. маскировки", 125000 },
            { "Модуль магнитной маскировки", 100000 },
            { "Система Прод. Маневрирования", 25000 },
            { "Дэмпер щитов", 2500000 },
            { "Усилитель щита", 372000 },
            { "Усилитель брони", 256000 },
            { "Тактический центр", 45600 },
            { "Модуль антиматерии", 126500 },
            { "Сенсорный массив", 66000 },
            { "Клетка Фарадея", 136900 }
        };

        public static readonly Dictionary<string, (int EnergyCostCell, int CellSize)> EnergyCostAndSizeByItem = new Dictionary<string, (int, int)>
        {
            {"Склад общий", (0, 1)},
            {"Склад медицины", (0, 1)},
            {"Склад боеприпасов", (0, 1)},
            {"Склад топлива", (0, 1)},
            {"Комната на 2 человека", (1, 1)},
            {"Кубрик на 6 человек", (1, 1)},
            {"Казарма на 20 человек", (2, 1)},
            {"Лаборатория", (7, 4)},
            {"СТО Наземной техники", (5, 15)},
            {"СТО Снаряжения", (3, 2)},
            {"Очиститель руды", (5, 3)},
            {"Очиститель лома", (4, 3)},
            {"Очиститель электроники", (5, 3)},
            {"Очиститель органики", (3, 3)},
            {"Очиститель химии", (6, 3)},
            {"Суперкомпьютер", (5, 3)},
            {"Буры механические", (2, 3)},
            {"Буры лазерные", (5, 3)},
            {"Медблок", (2, 1)},
            {"Тюрьма", (1, 1)},
            {"Учебный центр", (1, 3)},
            {"Мастерская", (3, 3)},
            {"Лавка/магазин", (1, 3)},
            {"Бар", (1, 3)},
            {"Мотель", (1, 3)},
            {"Часовня/церковь", (0, 3)},
            {"Бордель", (1, 3)},
            {"Кафе", (1, 3)},
            {"Казино", (3, 3)},
            {"Зал боевой подготовки", (2, 3)},
            {"Актовый зал", (1, 1)},
            {"Переговорная комната", (1, 1)},
            {"Центр связи", (4, 5)},
            {"Комната крио-анабиоза", (8, 2)},
            {"3D-принтер", (4, 3)},
            {"Модуль глубокого сканирования", (2, 5)},
            {"Мануфакторум", (15, 3)},
            {"Ускоритель выхлопа", (10, 3)},
            {"Модуль радио-оптич. маскировки", (15, 2)},
            {"Модуль магнитной маскировки", (5, 1)},
            {"Ангар общего назначения", (10, 10)},
            {"Система Прод. Маневрирования", (6, 1)},
            {"Дэмпер щитов", (7, 1)},
            {"Усилитель щита", (9, 1)},
            {"Усилитель брони", (3, 1)},
            {"Тактический центр", (3, 1)},
            {"Модуль антиматерии", (19, 3)},
            {"Сенсорный массив", (7, 1)},
            {"Клетка Фарадея", (0, 1)}
        };

        public static Dictionary<string, int> ManeuverabilityBySize { get; } = new Dictionary<string, int>
        {
            { "C", 95 },
            { "S", 80 },
            { "M", 60 },
            { "L", 40 },
            { "VL", 35 },
            { "A", 20 },
            { "X", 15 },
            { "XL", 10 },
            { "XXL", 5 },
        };

        public static Dictionary<string, int> HullBySize { get; } = new Dictionary<string, int>
        {
            { "C", 5 },
            { "S", 10 },
            { "M", 15 },
            { "L", 25 },
            { "VL", 35 },
            { "A", 50 },
            { "X", 65 },
            { "XL", 85 },
            { "XXL", 100 },
        };

        public static Dictionary<string, int> ArmorSize { get; } = new Dictionary<string, int>
        {
            { "C", 5 },
            { "S", 10 },
            { "M", 15 },
            { "L", 25 },
            { "VL", 35 },
            { "A", 50 },
            { "X", 65 },
            { "XL", 85 },
            { "XXL", 100 },
        };

        public static Dictionary<string, int> ShieldSize { get; } = new Dictionary<string, int>
        {
            { "C", 1 },
            { "S", 2 },
            { "M", 3 },
            { "L", 4 },
            { "VL", 5 },
            { "A", 6 },
            { "X", 7 },
            { "XL", 8 },
            { "XXL", 9 },
        };

        public static Dictionary<string, double> ReactorPowerMod { get; } = new Dictionary<string, double>
        {
            { "C", 0.2 },
            { "S", 0.5 },
            { "M", 1 },
            { "L", 1.4 },
            { "VL", 1.8 },
            { "A", 2.3 },
            { "X", 2.7 },
            { "XL", 3.3 },
            { "XXL", 4 },
        };

        public static Dictionary<string, (double ArmorMod, double ShieldMod, double ManeuverabilityMod, double ReactorMod)> ClassMultipliers { get; } = new Dictionary<string, (double, double, double, double)>
        {
            { "Мотоцикл", (0.4, 0, 1, 1) },
            { "Бронеавтомобиль", (2, 1, 1, 0.5) },
            { "Тягач", (0.5, 0.5, 1, 1) },
            { "Меха", (2, 2, 2, 0.5) },
            { "Грузовик", (0.5, 0.5, 1, 1) },
            { "БМП", (1.3, 1.3, 1, 1) },
            { "Лёгкий танк", (1.5, 1.5, 0.8, 1) },
            { "Тяжёлый танк", (2, 2, 0.5, 1) },
            { "САУ", (0.5, 0.5, 0.5, 1) },
            { "Мегамеха", (3, 3, 0.9, 2) },
            { "Подвижная крепость", (3, 2, 0.5, 3) },

            { "Амфибия", (0.5, 0.5, 1, 1) },
            { "Тягач(гиб.)", (0.7, 0.7, 1, 0.5) },
            { "БМП(гиб.)", (1.1, 1.3, 1, 0.7) },
            { "Лёгкий танк(гиб.)", (1.4, 1.5, 1, 0.7) },
            { "Болотный Катер", (1, 2, 1, 1) },
            { "Экраноплан", (1, 3, 1, 2) },

            { "Катер", (0.5, 0.5, 1.8, 1) },
            { "Миноносец", (1.2, 1.9, 1.5, 1) },
            { "Корвет", (1.9, 1.5, 1.3, 1) },
            { "Эсминец", (2.1, 2, 1, 1) },
            { "Фрегат", (2.2, 2.1, 0.8, 1) },
            { "Крейсер", (2.5, 2.8, 0.8, 2) },
            { "Линкор", (3, 2, 0.8, 2) },
            { "Авианосец", (2.2, 2, 0.5, 3) },
            { "МДК", (2, 2, 0.8, 1) },
            { "БДК", (2.1, 2.1, 0.6, 2) },
            { "УДК", (2.4, 2.4, 0.4, 2) },

            { "Подводный аппарат", (0.5, 0.5, 1, 0.5) },
            { "Батискаф", (1, 1, 1, 0.5) },
            { "Подводная лодка", (1, 1, 0.8, 1.5) },
            { "Подводный крейсер", (2, 2, 0.6, 1.5) },
            { "Подводный левиафан", (1.3, 1.3, 0.4, 2) }
        };
    }
}
